app/controllers/drives_controller.rb

  def index
    @drives = Drive.all
---
SELECT * FROM "drives"

  def show
    @drive = Drive.find(params[:id])
---
SELECT * FROM "drives" WHERE ("drives"."id" = 1)

  def create
    @drive = Drive.new(params[:drive])

    respond_to do |format|
      if @drive.save
---
INSERT INTO "drives" ("name", "updated_at", "info", "organizer_id", "collect_by", "sign_up_by", "collection_instructions", "created_at") VALUES(E'Welcome Pack 10', '2009-07-31 12:24:55.681013', E'Hello Again', 1, '2009-07-31 00:00:00.000000', '2009-07-31 00:00:00.000000', E'', '2009-07-31 12:24:55.681013')